Revit 2027 API
DividedPath.IsValidEndIndent Method
 Checks that the indent value does not cause the beginningIndent and endIndent to overlop
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidEndIndent(
	double endIndent
)
Public Function IsValidEndIndent (
	endIndent As Double
) As Boolean
public:
bool IsValidEndIndent(
	double endIndent
)
member IsValidEndIndent :
        endIndent : float -> bool
Parameters
endIndent Double
Return Value
Boolean
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace